Tekla Open API Reference for Tekla Structures 2025
View.ViewMarkTagAttributes Class
 The ViewMarkTagAttributes class contains attributes for view mark tags.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.ViewMarkBasicTagAttributes
 Tekla.Structures.Drawing.View.ViewMarkTagAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ViewMarkTagAttributes : ViewMarkBasicTagAttributes
<SerializableAttribute>
Public NotInheritable Class ViewMarkTagAttributes
	Inherits ViewMarkBasicTagAttributes
The View.ViewMarkTagAttributes type exposes the following members.
Constructors
Name | Description
View.ViewMarkTagAttributes()
 Creates a new mark tag attributes instance.
View.ViewMarkTagAttributes(Vector, TagLocation, TextAlignment, ContainerElement)
 Creates a new mark tag attributes instance with the given offset, location, alignment and content.
Top
Properties
Name | Description
Location
 The location of the mark tag.
 (Inherited from ViewMarkBasicTagAttributes.)
Offset
 The offset of the mark tag.
 (Inherited from ViewMarkBasicTagAttributes.)
TagAlignment
 The tag text alignment.
TagContent
 The tag content.
 (Inherited from ViewMarkBasicTagAttributes.)
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ViewMarkBasicTagAttributes.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace